In [2]:
import pandas as pd
import numpy as np

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avokado"])
string_data

0    aardvark
1         NaN
2        None
3     avokado
dtype: object

In [6]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
float_data = pd.Series([1,2,None], dtype=np.float64)
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

## Filtering out missing data

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
# This is same as 
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# dropna by default filters out all rows containing missing data
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
# Passing how="all" will drop only rows that contain all missing data 
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
# To drop columns param axis="columns" can be used
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.133428       NaN       NaN
1 -0.782415       NaN       NaN
2  0.847020       NaN -0.026591
3  0.908207       NaN -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [24]:
df.dropna()

          0         1         2
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [25]:
# tresh argument is a treshold for number of nan values in the row
df.dropna(thresh=2)

          0         1         2
2  0.847020       NaN -0.026591
3  0.908207       NaN -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

## Filling missing data

In [26]:
# fillna method is the workhorse
df.fillna(0)

          0         1         2
0  0.133428  0.000000  0.000000
1 -0.782415  0.000000  0.000000
2  0.847020  0.000000 -0.026591
3  0.908207  0.000000 -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [31]:
# fillna with a dict can use different fill value for each column
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.133428  0.500000  0.000000
1 -0.782415  0.500000  0.000000
2  0.847020  0.500000 -0.026591
3  0.908207  0.500000 -2.279466
4  0.403571  1.918942  0.186289
5 -0.893911  0.939770 -0.285286
6  0.587152  0.005989  2.158342

In [34]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.464487  0.543460 -1.233216
1 -0.047464 -0.650593 -1.689461
2  0.633390       NaN -1.305371
3 -0.360169       NaN  0.036989
4 -0.536153       NaN       NaN
5  0.940217       NaN       NaN

In [36]:
# we can use same interpolation methods as for reindexing: https://wesmckinney.com/book/pandas-basics#tbl-table_reindex_function
df.fillna(method = "ffill", limit=2)

/tmp/ipykernel_385/80795070.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill", limit=2)

          0         1         2
0 -0.464487  0.543460 -1.233216
1 -0.047464 -0.650593 -1.689461
2  0.633390 -0.650593 -1.305371
3 -0.360169 -0.650593  0.036989
4 -0.536153       NaN  0.036989
5  0.940217       NaN  0.036989

In [38]:
# We can do other things like simple data inputation using median or mean statistics
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [48]:
df = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], 
                   "k2": [1, 1, 2, 2, 3, 4, 4]})
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   4
6  two   4

In [49]:
# DataFrame method duplicated returns true if values in the row are duplicate of values
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   4

In [52]:
# Both methods, dupicated and drop_duplicates consider all columns. 
# There is option to provide subsef of columns
df["v1"] = range(7)
# df
df.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
# duplicated and drop_duplicates by defautl keep the first value combination observed
# Passing keep="last" will keep the last valueo combination observed
df.drop_duplicates(subset=["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [54]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [58]:
# We can add a column animal for a food by using map method
# map method on a Series accepts functipn or a dictionary like object containing mapping 
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [63]:
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [64]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [66]:
# Replace multiple values 
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [67]:
# Pass different replacements
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [69]:
# Argument passed can be a dictinoary
df.replace({-999: np.nan, -1000: 0})

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
5  two   4   5
6  two   4   6

## Renaming Axis Indexes

In [3]:
# Axis labels can be transforemd also
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [5]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [6]:
# index can be reasigned
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [7]:
# To create transformed version of data without modifynig the oriiginal there is a method rename
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [14]:
# rename can be used with dict
data.rename(index={"OHIO": "INDIANA"}, columns={"four": "bla"})

         one  two  three  bla
INDIANA    0    1      2    3
COLO       4    5      6    7
NEW        8    9     10   11

## Discretization and Binning

In [15]:
# Continous data is often discretized (using discrete values) of othervise separated into bins
# For example when people are grouped by age groups
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [17]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [18]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [21]:
pd.value_counts(age_categories)

/tmp/ipykernel_5465/3004322060.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [25]:
# To change which side is inclusive in bins use  right=False
age_categories = pd.cut(ages, bins, right=False)
age_categories

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [26]:
# To set bin labels
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
age_categories = pd.cut(ages, bins, labels=group_names)
age_categories

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [29]:
# Pandas cut accepts integer number of bins and it will compute equal length bins
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)

[(0.49, 0.71], (0.041, 0.26], (0.71, 0.93], (0.71, 0.93], (0.041, 0.26], ..., (0.49, 0.71], (0.26, 0.49], (0.71, 0.93], (0.041, 0.26], (0.49, 0.71]]
Length: 20
Categories (4, interval[float64, right]): [(0.041, 0.26] < (0.26, 0.49] < (0.49, 0.71] < (0.71, 0.93]]

In [32]:
# To get roghly equale sized bins qcut function can be used which uses sample quantiles to split the data
quantiles = pd.qcut(data, 4, precision=2)

quantiles

[(0.32, 0.59], (0.19, 0.32], (0.59, 0.93], (0.59, 0.93], (0.19, 0.32], ..., (0.32, 0.59], (0.32, 0.59], (0.59, 0.93], (0.032, 0.19], (0.32, 0.59]]
Length: 20
Categories (4, interval[float64, right]): [(0.032, 0.19] < (0.19, 0.32] < (0.32, 0.59] < (0.59, 0.93]]

In [33]:
pd.value_counts(quantiles)

/tmp/ipykernel_5465/3440030555.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quantiles)

(0.032, 0.19]    5
(0.19, 0.32]     5
(0.32, 0.59]     5
(0.59, 0.93]     5
Name: count, dtype: int64

In [34]:
# quantiles numbers can be provided as a param
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(0.040799999999999996, 0.113]    2
(0.113, 0.321]                   8
(0.321, 0.801]                   8
(0.801, 0.934]                   2
Name: count, dtype: int64

## Detecting and Filtering Outliers

In [35]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.011788    -0.073074     0.004708    -0.061630
std       0.991258     0.978951     1.019068     1.002610
min      -2.874142    -3.385795    -3.976066    -3.743075
25%      -0.629058    -0.677009    -0.648619    -0.773252
50%       0.005865    -0.051689     0.012645    -0.034156
75%       0.658594     0.594210     0.719960     0.643853
max       3.906020     2.809717     2.965389     2.883574

In [36]:
col  = data[2]
col[col.abs() > 3]

171   -3.976066
344   -3.303176
Name: 2, dtype: float64

In [46]:
# Interestinig that inside is boolean series and it seems like a nice way to get some filtering. Look at next cell to see the series
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
67   3.906020 -0.608294  0.931824  0.494663
117 -0.264322 -3.061265 -0.401051 -1.481163
166  0.208987  0.948507  0.234093 -3.743075
171 -0.178533  0.866963 -3.976066  1.191820
292  0.220396 -3.385795 -1.480584 -0.414677
344 -1.181539  0.546551 -3.303176  0.785812
392 -1.327993 -3.110166  0.357137 -1.694632
662  0.355648 -3.084890  0.780648  0.718564

In [48]:
# First one is series of 4 elementts and second one series of 1000 elements
(data.abs() > 3).any(), (data.abs() > 3).any(axis="columns")

(0    True
 1    True
 2    True
 3    True
 dtype: bool,
 0      False
 1      False
 2      False
 3      False
 4      False
        ...
 995    False
 996    False
 997    False
 998    False
 999    False
 Length: 1000, dtype: bool)

In [50]:
# Values can be set based on above criteria
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010882    -0.072432     0.005988    -0.060887
std       0.988104     0.976939     1.014769     1.000151
min      -2.874142    -3.000000    -3.000000    -3.000000
25%      -0.629058    -0.677009    -0.648619    -0.773252
50%       0.005865    -0.051689     0.012645    -0.034156
75%       0.658594     0.594210     0.719960     0.643853
max       3.000000     2.809717     2.965389     2.883574

In [51]:
# np.sign data produces 1 or -1 based on data being positive or negative
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0 -1.0

## Permutation and Random Sampling

In [54]:
# Randomly reordering series or data frame is posible usong numpy.random.permutation function
df = pd.DataFrame(np.arange(5*7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [55]:
# We permutate by providing number of rows or columns
sampler = np.random.permutation(5)
sampler

array([0, 2, 4, 1, 3])

In [58]:
# We use iloc or take function to reorder the data frame
df.take(sampler)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

In [60]:
df.iloc[sampler]

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

In [62]:
# We can do same with columns
sampler = np.random.permutation(7)
df.take(sampler, axis="columns")

    4   0   3   5   2   1   6
0   4   0   3   5   2   1   6
1  11   7  10  12   9   8  13
2  18  14  17  19  16  15  20
3  25  21  24  26  23  22  27
4  32  28  31  33  30  29  34

In [63]:
# Series and dataframe have sample method that can be used to select random subset
df.sample(3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27

In [64]:
# To generate sampler with replacement(to allow choices to repeat) use replace=True
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

0    5
4    4
2   -1
2   -1
2   -1
1    7
4    4
1    7
0    5
0    5
dtype: int64

## Computing Indicator/Dummy Variables

In [71]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [73]:
# Getting dummy variables for a categorical variable, like for example in Titanic Place where passenger departured from 
# is one columns with 3 distinct values (categories). This would create three columns. One for each category. Containing
# 0 or 1 marking that for that category columns specific value is matching or not.
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [75]:
# Prefix can be added for new columns
pd.get_dummies(df["key"], prefix="key", dtype=int)

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [78]:
# A usefull recipe for statistical applications is to combine get_dummies with discretization function like cut
np.random.seed(12345)

values = np.random.uniform(size=10)
# values

bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

## Extension data types

In [80]:
# By default series will use float and np.nan in case when data is ints and there are some missing values
s = pd.Series([1,2,3,None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [81]:
# Pandas has it's own dtype
s = pd.Series([1,2,3,None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [83]:
# Pandas use pd.NA for None
s[3] is pd.NA

True

In [84]:
# Shorter version can be used for data type, but I like more to not use strings
s = pd.Series([1,2,3,None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [90]:
# String would be object type
s = pd.Series(["one", "two", None, "three"], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [91]:
# Extension types can be passed to the Series astype method
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})

df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [94]:
df["A"] = df["A"].astype(pd.Int64Dtype())
df["B"] = df["B"].astype(pd.StringDtype())
df["C"] = df["C"].astype(pd.BooleanDtype())
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

# String Manipulation
Pandas enable applying string and regular expression manipulation on a whole arrays of data

## Python Builti-In String Object Methods

In [96]:
# Most of the time built in string methods are sufficiant
# Example comma separated string can be broken by split method
val = "a,b,   guido"
val.split(",")

['a', 'b', '   guido']

In [97]:
# It is often combined with the strip to trim whitespace
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [98]:
# Substrings can be concanated
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [99]:
# But faster and more pythonic way is to pass a list or a tuple to the join method
"::".join(pieces)

'a::b::guido'

In [100]:
# When locating substring there is Python in keyword
"guido" in val

True

In [101]:
# There is index
val.index(",")

1

In [106]:
# And there is find. find returns -1 and does not raise exception. val.index(":") would raise exception
val.find(":")

-1

In [107]:
# Count returns the number of occurencies
val.count(",")

2

In [108]:
# replace will substitute occurences of one pathern for another
val.replace(",","::")

'a::b::   guido'

In [109]:
val.replace(",","")

'ab   guido'

## Regular expressions

In [112]:
# Python builtin re module is responsible for applying regulara expressions to strings
import re

text = "foo     bar\t baz   \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [115]:
# Regex is above implicitly compiled. It can be compiled explicitelly. This approach is highly recomended if same regex is applied to many strings. This saves CPU cycles. 
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [114]:
# To get a list of all patterns matching regex 
regex.findall(text)

['     ', '\t ', '   \t']

In [116]:
# match and search are related to findall, findall returns all matches in the string, search returns the first one and match only matches at the beggining 
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [117]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [118]:
m = regex.search(text)
m

In [119]:
print(regex.match(text))

None

In [120]:
# Relatedly sub will return new string with all occurencies matched replaced with the replacement string
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [122]:
# To find all occurencies of email addresses and to simultaniosly segment out each address into it's components: username, domain name and domain sufix we can user groups
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [124]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [126]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [130]:
# sub has access to groups using special simbols like \1 ... \2 ... \3
print(regex.sub(r"Username \1, Domain \2, Suffix: \3", text))

Dave Username dave, Domain google, Suffix: com
Steve Username steve, Domain gmail, Suffix: com
Rob Username rob, Domain gmail, Suffix: com
Ryan Username ryan, Domain yahoo, Suffix: com

## String Functions in pandas

In [150]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}

data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [148]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [149]:
# String and regular expressions methods could be applied passing lambda or a function to each value using data.map but this would fail on NA(null) values
# To overcome this panas has string methods that can be applied to a series and are accessed through series str attribure and that skip and propagate NA values
# data.str.contains("gmail")
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [151]:
# We can also use pandas types
data_as_string_ext = data.astype(pd.StringDtype())
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [152]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [156]:
# Patterns can be used also
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [158]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [159]:
# We can also slice strings using this sintax
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [160]:
# str.extract will return captured groups of a regular expression as DataFrame
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

# Categorical Data

In [65]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [66]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [67]:
pd.value_counts(values)

/tmp/ipykernel_5465/3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [68]:
values.value_counts()

apple     6
orange    2
Name: count, dtype: int64

In [69]:
# Often we use dimensions tables and we just use id for the dimension in other tables in SQL for example
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [70]:
dim

0     apple
1    orange
dtype: object

In [71]:
# We can use take method to get dimension values
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

This representation is called categorical or dictionary encoded representation. The array of distinct values can be called categories, dictionary or levels of data. The integer values thet reference the categories are called the category codes or simply codes.

## Categorical Extension Types in Panda

In [77]:
# Pandas has special extended type that holds integer based categorical representation or encodinig. The class is Categoriical
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [83]:
# we can convert to category like below
fruit_cat = df["fruit"].astype(pd.CategoricalDtype())
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [85]:
c = fruit_cat.array
c, type(c)

(['apple', 'orange', 'apple', 'apple', 'apple', 'orange', 'apple', 'apple']
 Categories (2, object): ['apple', 'orange'],
 pandas.core.arrays.categorical.Categorical)

In [89]:
# The categorical object has categories and codes attributes
c.categories

Index(['apple', 'orange'], dtype='object')

In [90]:
c.codes
# This can be accessed more easily using cat accessor which will be explained later in Categorical Methods

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [91]:
# A usefull trik to get mapping between codes and categories 
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [93]:
# we can convert the data frame column to categorical by assigning the converted results
df["fruit"] = df["fruit"].astype(pd.CategoricalDtype())
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [ ]:
# You can also create pandas.Categorical directly from other types of Python sequences: